/*Функции роли вносящего данные
	- Добавить доход
	- Добавить расход
	- Посмотреть баланс
	- Отправить баланс
	- Получить виды доходов
	- Получить виды расходов
   Функции Получателя данных
	- Посмотреть баланс
	- Посмотреть доход
	- Посмотреть расход
   Функции роли администратора структуры видов доходов/расходов (возможно добавить изменение других таблиц БД)
	- Посмотреть виды расходов
	- Посмотреть виды доходов
	- Добавить вид доходов
	- Добавить вид расходов
	- Удалить вид доходов (все удаленные виды доходов переносятся в указанный вид доходов)
	- Удалить вид расходов(все удаленные виды расходов переносятся в указанный вид расходов)
	- Сделать бэкап БД.
   Функции Отправителя данных
	- Отправить баланс в виде pdf, word, xml на почту
	- Открыть баланс в браузере.*/

namespace TelegramBotHomeFinancesLib
{
    internal interface IHomeFinanceService
    {

    }
}
